---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BoundingBoxIsInsideFilter
source: html/d174f86b-5f18-6921-da06-4e22cc3cf38b.htm
---
# BoundingBoxIsInsideFilter Members

Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline.